Repository: FatAliens/achieveclubmobileclient
Catalog: lib/l10n/app_*.arb
Languages: pl, ru

# profil
source: Profile
pl: Profil
ru: Профиль

# tab1
source: Profile
pl: Profil
ru: Профиль

# tab2
source: Top 100 students
pl: Top 100 użytkowników
ru: Топ 100 студентов

# tab3
source: Top clubs
pl: Top kluby
ru: Топ клубов

# fetchCompletedAchieveError
source: Error loading completed achievements
pl: Błąd ładowania ukończonych osiągnięć
ru: Ошибка при загрузке выполненных достижений

# refreshTokenError
source: Error during token update
pl: Błąd aktualizacji tokena
ru: Ошибка при обновлении токена авторизации

# fetchUserError
source: Error loading user information
pl: Błąd podczas ładowania użytkownika
ru: Ошибка при загрузке информации пользователя

source: Close
pl: Zamknij
ru: Закрыть

source: Achievements
pl: Osiągnięcia
ru: Достижения

# showQrToTrainee
source: Please show the QR code to the coach.
pl: Prosimy o pokazanie kodu QR trenerowi
ru: Пожалуйста, покажите QR-код тренеру.

# fetchAchievementError
source: Error loading achievements
pl: Błąd ładowania osiągnięć
ru: Ошибка при загрузке достижений

# uploadAvatarError
source: Error when uploading avatar
pl: Błąd podczas zmiany awatara
ru: Ошибка при загрузке аватара

source: Completed achievements
pl: Ukończone osiągnięcia
ru: Выполненные достижения

source: Percent completed achievements
pl: Procent ukończonych osiągnięć
ru: Процент выполненных достижений

# unCompletedAchievements
source: Unfulfilled accomplishments
pl: Niespełnione osiągnięcia
ru: Невыполненные достижения

# loadingPageError
source: Error when building a page
pl: Błąd podczas ładowania strony
ru: Ошибка при построении страницы

source: Error
pl: Błąd
ru: Ошибка

# fetchClubsError
source: Error when load clubs data
pl: Błąd podczas ładowania klubów
ru: Ошибка при загрузке клубов

source: User profile
pl: Profil użytkownika
ru: Профиль пользователя

# confirmEmail
source: Confirmation of e-mail address
pl: Potwierdź adres e-mail
ru: Подтверждение адреса электронной почты

# codeSended
source: You received a code by email
pl: Otrzymałeś kod na adres e-mail
ru: Вы получили код по электронной почте

source: Send
pl: Wyślij
ru: Отправить

source: Email confirmed.
pl: Adres e-mail został potwierdzony
ru: Почта подтверждена.

# wrongCode
source: Incorrect code entered
pl: Wprowadzono nieprawidłowy kod
ru: Введен неправильный код или

source: Repeat
pl: Powtórzyć
ru: Повторить

# continued
source: Continue
pl: Ciąg dalszy nastąpi
ru: Продолжить

source: Registration
pl: Rejestracja
ru: Регистрация

# selectClub
source: Select a club
pl: Wybierz klub
ru: Выберите клуб

source: Name
pl: Imie
ru: Имя

# nameError
source: The name must contain at least 2 letters
pl: Imie musi składać się z co najmniej 2 znaków
ru: Имя должно содержать минимум 2 буквы

# emptyName
source: Name must be filled in
pl: Wymagane imie
ru: Имя должно быть заполнено

# surname
source: Last name
pl: Nazwisko
ru: Фамилия

# surnameError
source: Last name must contain at least 5 letters
pl: Nazwisko musi składać się z co najmniej 5 znaków
ru: Фамилия должна содержать минимум 5 буквы

# emptySurname
source: Last name must be filled in
pl: Nazwisko jest obowiązkowe
ru: Фамилия должна быть заполнена

# emailError
source: The specified email is not validа
pl: Nieprawidłowy adres e-mail
ru: Указаная почта не валидна

# emptyEmail
source: Email must be specified
pl: Wymagany jest adres e-mail
ru: Почта должна быть указана

source: Password
pl: Hasło
ru: Пароль

# passwordError
source: The password must contain at least 6 characters and at least 1 letter or 1 number.
pl: Hasło musi zawierać co najmniej 6 znaków i co najmniej 1 litera lub 1 cyfra
ru: Пароль должен содержать не менее 6 символов и не менее 1 буквы или 1 цифры.

# emptyPassword
source: Password is required
pl: Hasło jest obowiązkowe
ru: Пароль обязателен для заполнения

# confirmPassword
source: Password confirmation
pl: Potwierdź hasło
ru: Подтверждение пароля

# confirmPasswordError
source: Password mismatch
pl: Hasła muszą być zgodne
ru: Пароли не совпадают

# emptyConfirmPassword
source: Password confirmation is required
pl: Potwierdzenie hasła jest obowiązkowe
ru: Подтверждение пароля обязательно

# registrate
source: Register
pl: Zarejestruj się
ru: Зарегистрируйтесь

# writeNewPassword
source: Write a new password
pl: Wprowadź nowe hasło
ru: Введите новый пароль

source: Forgot password?
pl: Zapomniane hasło?
ru: Забыли пароль?

source: Login
pl: Zaloguj się
ru: Войти

# emailPassError
source: The email or password is not correct.
pl: Adres e-mail lub hasło są nieprawidłowe
ru: Почта или пароль указаны не верно.

# loginError
source: Couldn't get in!
pl: Nie udało się wejść
ru: Не удалось войти!

# emptyFields
source: All fields must be filled in
pl: Wypełnij wszystkie pola
ru: Все поля должны быть заполнены

source: Authorization
pl: Autoryzacja
ru: Авторизация

source: Club
pl: Klub
ru: Клуб

# avgXP
source: XP
pl: Średnie doświadczenie
ru: Количество опыта

# clubId
source: Selected club id
pl: Wybrany identyfikator klubu
ru: Выбранный клуб

source: Complete percent
pl: Procent realizacji
ru: Процент выполнения

source: Club history
pl: Historia klubu
ru: История клуба

# clubStudents
source: Students of club
pl: Użytkownicy w klubie
ru: Студенты клуба

source: Completion count
pl: Zrobione raz
ru: Выполнено раз

# multipleCompletedAchievements
source: Multiple Achievements Completed
pl: Dokonane osiągnięcia
ru: Многоразовые выполненные достижения

# codeSendedAfter
source: Код уже отправлен, если вы не получили код - попробуйте через 5 минут.
pl: Код уже отправлен
ru: Код уже отправлен
